# DeleteWorksetOption Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
DeleteWorksetSettings..::..DeleteWorksetOption Property
DeleteWorksetSettings Class See Also
---
The current delete workset option.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2022.1
# Syntax
C#
---
```text
public DeleteWorksetOption DeleteWorksetOption { get; set; }
```

Visual Basic
---
```text
Public Property DeleteWorksetOption As DeleteWorksetOption
	Get
	Set
```

Visual C++
---
```text
public:
property DeleteWorksetOption DeleteWorksetOption {
	DeleteWorksetOption get ();
	void set (DeleteWorksetOption value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentOutOfRangeException | When setting this property: A value passed for an enumeration argument is not a member of that enumeration |

# See Also
DeleteWorksetSettings Class
Autodesk.Revit.DB Namespace